[{"rating":4.0,"name":"Viet Garden","reviews":["My husband and I have been slowly making the rounds of the multitude of Vietnamese restaurants in the area in an effort to determine our favorite. The other...","After traveling to Thailand this past summer, I became quite a lover of Thai food. It is hard to find a good Thai, or for that matter an Asian cuisine...","not much I can say that hasn't been said allready.  but out of 22 reviews there is only 1 bad one here.  so what does that tell you?   I use to eat there..."],"address":"1237 E Colonial Dr, Orlando, FL 32803"},{"rating":4.33,"name":"Le Coq Au Vin","reviews":["If your palate is tired of eating a la Mickey Mouse then this restaurant is for you. I found this restaurant through Yelp and was not disappointed. We went...","Excellent prices for a French dinner. Probably not the best French food I have had. Not all of their dishes are worthwhile but they do have a few that are...","Le Coq Au Vin was definitely a fantastic find and worth the trip.  The neighborhood leading up to the place was a little sketch (and the restaurant is..."],"address":"4800 S Orange Ave, Orlando, FL 32806"},{"rating":4.0,"name":"Rangetsu","reviews":["One of my favorite places to splurge in Orlando. It's a bit pricey, but worth it.\n\nWent back this past weekend, and was sad to hear that the taiko...","This is a pretty cool spot for I-drive (tourist hell).  The entire restaurant looks over the garden in front, which helps you forget where you are.  \n\nMy...","I think it's operated by the same people who run the restaurant in Japan.  Not open for lunch which was a shame.  Good Food and Decent Pricing.  Serves..."],"address":"8400 International Dr, Orlando, FL 32819"},{"rating":4.0,"name":"Napasorn Thai Restaurant","reviews":["Napasorn is a great little Thai restaurant and Sake barlocated on Pine St.  in downtown Orlando.  The interior of the restaurant is quaint and casual.  The...","Good location, wifi for working lunches (and iPhones), better than average Pad Thai and sushi.","I am SO glad we stumbled upon this place.  We just moved to the area and have found ourselves going to downtown Orlando on occasion for a night out.  We..."],"address":"56 E Pine St, Orlando, FL 32801"},{"rating":4.67,"name":"K Restaurant and Wine Bar","reviews":["Had the pleasure of going to the quaint K Wine Bar in downtown College Park.  I was referred by a colleague who said that everything was excellent, so I...","So I had flown to Orlando for work. A week there didn't seem so bad until I woke up the next day and needed a place to eat.\nMY GOD.\nAwful.\nI mean call me...","It was last Christmas and Niki and I attended a family gathering at my aunt's home in Florida. Over wine and hors d'oeuvres we all shared holiday cheer and..."],"address":"2401 Edgewater Dr, Orlando, FL 32804"},{"rating":2.33,"name":"Ceviche","reviews":["This is probably the best restaurant in downtown, and my favorite by far.  The tapas are very good, never really had anything bad there.  And the music and...","We had gone here for a very special occasion and had traveled very far to do so. The management on the evening in question were the rudest I have ever dealt...","See Zach H. and Patrick P. s review.  I really can not stand restaurants that\n A)make mistakes and don't own up to them\nB)People in the service industry..."],"address":"125 W Church St, Orlando, FL 32801"},{"rating":5.0,"name":"Roy's","reviews":["Roy's is one of the finest restaurants in Orlando.  My family has a deep love of gourmet dining, and Roy's never fails to satisfy us.","On my recent road trip to Orlando, FL, an exhausting 22-hr drive from NY. I was ecstatic about our trip but I need to seek a refuge for a familiar haven...","We've been to many of the Hawaii locations, but first time at this location.  It was a perfect experience again.  Free valet.  Hostess was away from her..."],"address":"7760 W Sand Lake Rd, Orlando, FL 32819"},{"rating":4.0,"name":"Shari","reviews":["I've been here for the sushi happy hour twice now, and once for dinner, and was impressed neither time. More emphasis on location and decor than substance...","A friend suggested we go downtown for dinner on a trip to Orlando.  We went to happy hour at Shari and were SO glad we did!  All the sushi on the happy hour...","i worked here years ago and have got to say it is one of the cleanest restaurants i've ever worked in, and the staff is super nice.\n\ngo here now and eat a..."],"address":"621 E Central Blvd, Orlando, FL 32801"},{"rating":3.0,"name":"New Punjab Indian Restaurant","reviews":["Very good.. Need to bring in more light inside.","My boyfriend and I went here after coming from Wet 'N Wild. There seemed to be a bunch of Indian restaurants on this part of International Drive so the pick...","Mmmm....no.\n\nAfter getting situated at the hotel, it was time to venture out and get some food.  I thought an Indian lunch buffet sounded good, so I turned..."],"address":"7451 International Dr, Orlando, FL 32819"},{"rating":3.33,"name":"Cafe Tu Tu Tango","reviews":["I ate here last night.  I used to think that the food was good here.  I am not sure anymore.  The atmosphere is nice and there is tons of art on the walls....","Over the past few months, I've come to know this restaurant as my regular spot. I fell in love with this place from the moment I walked through the doors....","Tu Tu Tango is really a 2.5 star kind of place based on food but the ambiance and entertainment make up for the lack luster food. The place is always packed..."],"address":"8625 International Dr, Orlando, FL 32819"},{"rating":4.67,"name":"Padrino's Cuban Bistro","reviews":["Went on vacation to Disney World last week and wanted to try a local cuban restaurant and used yelp to find this place. We happened to go on their Havana...","We came here based on other Yelp reviews while visiting Orlando. The restaurant was located in a nice and new shopping center away from the touristy part of...","We are a big fan of these place! Just last week we've been there 3 times.\nWe love everything about Padrino': the food, the atmosphere, the owners are super..."],"address":"13586 S. John Young Pkwy, Orlando, FL 32837"},{"rating":4.33,"name":"Carrabba's Italian Grill","reviews":["While visiting my boyfriend, we ate at this Carrabba's.  This restaurant is one of the best restaurants I've ever eaten at anywhere anytime.  The wait to be...","Carrabba's is Italian grilling at its best. I always eat the Steak Marsala with a little pasta and a nice Chianti. Servers are always happy, knowledgable...","Once again I'm accosted by people who are \"Florida Nice.\" You know the type, you'll get serviced in a timely manner, but somehow you know they'd rather be..."],"address":"1001 Sand Lake Rd, Orlando, FL 32809"},{"rating":2.33,"name":"Universal CityWalk","reviews":["To add to what other reviewers have said...\n\nCheesy & touristy (well, duh)\n\nI don't know what other nightlife options one would have in a tourism-driven...","Lots of sensory stimulation in this place.  Bright lights, music, stuff that flashes.  It's a great place to go and walk around.  I really like Bob...","Universal CityWalk is basically an outdoor mall with more restaurants than shops. There are numerous places to eat and drink and there is even a movie..."],"address":"6000 Universal Blvd, Orlando, FL 32819"},{"rating":4.33,"name":"Little Saigon Restaurant Inc","reviews":["Still a great place for Viet food ... but imagine my disappointment when after MONTHS of being away (and craving the pork/spring roll/vermicelli dish) we...","Great place for Vietnamese. \n\nThis place is better than many others for a few reasons.  First, and foremost, the food.  My spicy beef pho was awesome.  The...","Ummm Spring Rolls.. Man I'm having a flash back to my Orlando years tonight. First Publix subs and now Little Saigon. I lived about 3 blocks away for 6..."],"address":"1106 E Colonial Dr, Orlando, FL 32803"},{"rating":3.0,"name":"Mythos Restaurant","reviews":["Went here last weekend on a trip to IOA. Was bit intimidated by the decor because theme park food is already expensive, it made me worried how much a nice...","Ok - First off you are in the middle of an amusement park so the mere fact that there is a sit down service restaurant is a blessing (especially since it's...","Claim is \"voted best theme park Restaurant in the world five times.\". Don't believe it.  Menu was inventive (I had the blue berry and blue cheese pork), and..."],"address":"1000 Universal Studios Plaza, Orlando, FL 32819"},{"rating":4.33,"name":"Bosphorous Turkish Cuisine","reviews":["I'll start by saying that I loved the food here. It was excellent and the portions are large--even the appetizers--which really works if you're planning on...","My favorite restaurant in all of winter park!  Delicious and genuine Turkish meals make Bosphorous stand out among park ave bistros and restaurants! Seating...","I like Bosphorous for a late lunch or an early dinner, the reason being that at those times the restaurant is relatively empty and feels rather private...."],"address":"108 S Park Ave, Winter Park, FL 32789"},{"rating":4.67,"name":"Garden Cafe","reviews":["One of the things I love about Garden Cafe is the selection of foods.  You can get Beef, Chicken, Pork, Fish, Lamb, Steak, Tofu; all prepared with meat...","I am so grateful for this restaurant!  It satisfied my palate for some good down to earth vegetarian cooking.  I was growing weary of spending 10.00 on...","My husband I are vegetarians and have enjoyed dining here many, many times.  The Orange \"Beef\" is wonderful... crispy pieces of dark soy protein in a sweet,..."],"address":"810 W Colonial Dr, Orlando, FL 32804"},{"rating":4.33,"name":"Hanamisuki Japanese Restaurant","reviews":["I'll admit now - Orlando is not my favorite city. Even though I find myself here every year or so, I never really enjoy my stay here for one reason: Orlando...","Overall, my experiences at this restaurant has been quite pleasant. I come to Floria often for training and each time I come, I have to hit this restaurant...","Ok, so I hit a couple anime conventions a year to reconnect with friends from the far reaches of Florida. We're all pretty interested in Japanese food, and..."],"address":"8255 International Dr, Orlando, FL 32819"},{"rating":2.67,"name":"Emeril's Tchoup Chop","reviews":["The place was gorgeous but the food wasn't. I was really disappointed by the food. I would not go there again. Expensive and the food really was close to...","Surprisingly mediocre. We read very good reviews online and were expecting great things. We'd just had dinner @ Casa Juancho in Miami the night before and...","It's a bit of a drive out to City Walk, but it's definitely worth it.\nI started out with a green tea mitarito at the bar and it was quite good.\nThe endless..."],"address":"6300 Hollywood Way, Orlando, FL 32819"},{"rating":4.67,"name":"Juliana's Fine Tuscan Cuisine","reviews":["Went there on a date last Saturday night and it was delicious. We had the shrimp cristines to start. We shared the spinach salad and it had the best goat...","I love a restaurant that sets itself apart from others in some way.  This quaint and cozy little Tuscan eatery is set apart from others in it's atmosphere,...","This Tuscan inspired restaurant in College Park sticks with the simplistic nature of most true Italian restaurants.  They offer a few pasta options, a few..."],"address":"2306 Edgewater Dr, Orlando, FL 32804"}]